# 实验五 接入Internet 与小型网络设计实验

## 接入 Internet

### 实验目的

1. 验证宽带接入Internet的设计过程；
2. 熟悉接入控制设备的配置过程；
3. 熟悉终端宽带的接入过程；
4. 熟悉本地鉴别方式鉴别终端用户过程，以及用户终端访问Internet的过程。

### 实验步骤

#### 首先建立网络拓扑

![image-20241119160521604](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241119160521604.png)

#### 配置Router0

配置Router0端口

```
Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface f0/0
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#ip addr 1.1.1.1 255.0.0.0
Router(config-if)#exit
Router(config)#int f0/1
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up

Router(config-if)#ip addr 192.168.2.1 255.255.255.0
Router(config-if)#exit
```

配置Router0动态路由

```
Router(config)#route rip
Router(config-router)#network 192.168.2.0
Router(config-router)#exit
```

配置Router0接入控制功能

```
Router(config)#vpdn enable
Router(config)#vpdn-group b1
Router(config-vpdn)#accept-dialin
Router(config-vpdn-acc-in)#protocol pppoe
% This command is not supported by Cisco Packet Tracer.
Router(config-vpdn-acc-in)#virtual-template 1
% PPPoE config from vpdn-group is converted to pppoe-profile based config.
% Continue PPPoE configuration under 'bba-group pppoe global'
Router(config-vpdn-acc-in)#exit
Router(config-vpdn)#exit

Router(config)#ip local pool c1 192.168.1.1 192.168.1.14
Router(config)#aaa new-model
Router(config)#aaa authentication ppp a1 local
Router(config)#interface virtual-template 1

Router(config-if)#ip unnumbered f0/0
Router(config-if)#peer default ip addr pool c1
Router(config-if)#ppp authentication chap a1
Router(config-if)#exit
Router(config)#username aaa1 password bbb1
Router(config)#username aaa2 password bbb2

Router(config)#int f0/0
Router(config-if)#pppoe enable
Router(config-if)#
%LINK-5-CHANGED: Interface Virtual-Access2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Virtual-Access2, changed state to up

Router(config-if)#exit
Router(config)#
```

#### 配置Router1

配置路由器端口

```
Router>en
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int f0/0
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#ip addr 192.168.2.2 255.255.255.0
Router(config-if)#int f0/1
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

Router(config-if)#ip addr 192.168.3.1 255.255.255.0
Router(config-if)#exit
```

配置动态路由

```
Router(config)#router rip
Router(config-router)#network 192.168.2.0
Router(config-router)#network 192.168.3.0
Router(config-router)#exit
```

配置静态路由

```
Router(config)#ip route 192.168.1.0 255.255.255.240 192.168.2.1
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console
```

#### 拨号接入

![image-20241119161800252](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241119161800252.png)

结果发现连接超时（Connect time out），此时回去查看路由器接口信息，发现`Virtual-Template1`接口并没有被正确打开。

```
Router#sh ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
FastEthernet0/0        192.168.1.1     YES manual up                    up 
FastEthernet0/1        192.168.2.1     YES manual up                    up 
Virtual-Template1      192.168.1.1     YES unset  down                  down 
Virtual-Access1        unassigned      YES unset  down                  down 
Virtual-Access2        unassigned      YES unset  up                    up 
Vlan1                  unassigned      YES unset  administratively down down
```

重新设置

```
Router(config)#username pc1 password 123
Router(config)#username pc2 password 123
Router(config)#bba-group pppoe mygroup
Router(config-bba)#
%LINK-5-CHANGED: Interface Virtual-Access1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Virtual-Access1, changed state to up

Router(config-bba)#virtual-template 1
Router(config-bba)#exit
Router(config)#interface virtual-template 1

Router(config-if)#peer default ip address pool mypool
Router(config-if)#ppp authentication pap
AAA: Warning, authentication list default is not defined for PPP.

Router(config-if)#exit
Router(config)#ip local pool mypool 192.168.1.10 192.168.1.20
Router(config)#interface FastEthernet0/0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#pppoe enable group mygroup

Router#show running-config | include username
username pc1 password 0 123
username pc2 password 0 123
Router#show running-config | section virtual-template
  virtual-template 1
Router#conf term
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface virtual-template 1
Router(config-if)#ip unnumbered FastEthernet0/0
Router(config-if)#peer default ip address pool mypool
	
Router(config-if)#ppp authentication pap
AAA: Warning, authentication list default is not defined for PPP.

Router(config)#interface FastEthernet0/0
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#
%LINK-5-CHANGED: Interface Virtual-Access1.1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Virtual-Access1.1, changed state to up

%LINK-5-CHANGED: Interface Virtual-Access1.2, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Virtual-Access1.2, changed state to up
```

![image-20241121095210142](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241121095210142.png)

#### 测试连通性

前面已经添加了动态路由，还需要添加静态路由，查询地址池

```
Router#show running-config | include ip local pool
ip local pool mypool 192.168.1.10 192.168.1.20
```

得到子网掩码为255.255.255.240即28，设置之后，将Router1的主机全部设置成DHCP设置，自动分配。

查询这边主机的信息

```
C:\>ipconfig

FastEthernet0 Connection:(default port)

   Connection-specific DNS Suffix..: 
   Link-local IPv6 Address.........: FE80::201:64FF:FE89:18C6
   IPv6 Address....................: ::
   Autoconfiguration IPv4 Address..: 169.254.24.198
   Subnet Mask.....................: 255.255.0.0
   Default Gateway.................: ::
                                     0.0.0.0

Bluetooth Connection:

   Connection-specific DNS Suffix..: 
   Link-local IPv6 Address.........: ::
   IPv6 Address....................: ::
   IPv4 Address....................: 0.0.0.0
   Subnet Mask.....................: 0.0.0.0
   Default Gateway.................: ::
                                     0.0.0.0

```

发现无法连接，原因在于添加的路由指定的网络是192.168.3.0/24，需要重新更改DHCP分配的范围。

```
Router(config)#ip dhcp pool mypool
Router(dhcp-config)#network 192.168.3.0 255.255.255.0
Router(dhcp-config)#default-router 192.168.3.1
Router(dhcp-config)#dns-server 8.8.8.8
Router(dhcp-config)#range 192.168.3.10 192.168.3.100
```

最后Ping通

```
C:\>ping 192.168.3.3

Pinging 192.168.3.3 with 32 bytes of data:

Reply from 192.168.3.3: bytes=32 time<1ms TTL=126
Reply from 192.168.3.3: bytes=32 time=4ms TTL=126
Reply from 192.168.3.3: bytes=32 time<1ms TTL=126
Reply from 192.168.3.3: bytes=32 time<1ms TTL=126

Ping statistics for 192.168.3.3:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 0ms, Maximum = 4ms, Average = 1ms

```

### 实验提高

创建网络拓扑，添加一个无线接入点，然后替换两个笔记本的网卡为无线网卡并创建密码后连接

![image-20241121103732713](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241121103732713.png)

设置路由器

```
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#username pc3
Router(config)#username pc3 password 123
Router(config)#username pc4 password 123
```



拨号

![image-20241121103714317](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241121103714317.png)

## 中小企业网规划设计与配置实现

### 实验目的

1. 掌握二层交换、三层交换、路由的配置与管理方法，以及NAT技术。
2. 能够利用2—3台二层交换机，1台三层交换和1-2台路由器，4—6台电脑和NAT 技术对组网方案进行部署实施与测试分析，并通过分析能得出有效结论。
3. 能够对所组网络进行相关的安全性配置与管理。

### 实验内容

1. 四个办公室的任何一台电脑都能够访问外网的两台服务器（使用NAT实现）；
2. 办公室1、2、4之间的电脑能相互访问；
3. 办公室3中的电脑与办公室1、2、4之间不能访问；
4. 办公室1和办公室4之间的电脑能实现漫游，即办公室1的电脑移动到办公室4之后能继续上网，反之也是。

### 实验步骤

创建设备端，首先设置两个AP的名称和密码，并替换笔记本的网卡，首先连入。同时连接交换机。

![image-20241121104636183](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241121104636183.png)

建立完整拓扑

![image-20241121111831996](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241121111831996.png)

在三层交换机中配置VLAN

```
Switch(config)#interface vlan 10
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan10, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan10, changed state to up

Switch(config-if)#ip address 192.168.10.1 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#interface vlan 20
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan20, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan20, changed state to up

Switch(config-if)#ip address 192.168.20.1 255.255.255.0
Switch(config-if)#no shutdown

Switch(config-if)#interface vlan 30
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan30, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan30, changed state to up

Switch(config-if)#ip address 192.168.30.1 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#
```

在三层交换机上设置DHCP服务器

```
Switch(config)#ip dhcp excluded-address 192.168.10.1
Switch(config)#ip dhcp excluded-address 192.168.20.1
Switch(config)#ip dhcp excluded-address 192.168.30.1
Switch(config)#ip dhcp excluded-address 192.168.40.1
Switch(config)#int vlan 10
Switch(config-if)#ip address 192.168.10.1 255.255.255.0
Switch(config-if)#ip routing
Switch(config)#ip dhcp pool OFFICE_1
Switch(dhcp-config)#network 192.168.10.0 255.255.255.0
Switch(dhcp-config)#default-router 192.168.10.1
Switch(dhcp-config)#exit
Switch(config)#int vlan 20
Switch(config-if)#ip address 192.168.20.1 255.255.255.0
Switch(config-if)#ip routing
Switch(config)#ip dhcp pool OFFICE_2
Switch(dhcp-config)#network 192.168.20.0 255.255.255.0
Switch(dhcp-config)#default-router 192.168.20.1
Switch(dhcp-config)#exit
Switch(config)#int vlan 30
Switch(config-if)#ip address 192.168.30.1 255.255.255.0
Switch(config-if)#ip routing
Switch(config)#ip dhcp pool OFFICE_3
Switch(dhcp-config)#network 192.168.30.0 255.255.255.0
Switch(dhcp-config)#default-router 192.168.30.1
Switch(dhcp-config)#exit
Switch(config)#int vlan 30
Switch(config-if)#ip routing
Switch(config)#int vlan 40
Switch(config-if)#
%LINK-5-CHANGED: Interface Vlan40, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan40, changed state to up

Switch(config-if)#ip address 192.168.40.1 255.255.255.0
Switch(config-if)#ip routing
Switch(config)#ip dhcp pool OFFICE_4
Switch(dhcp-config)#network 192.168.40.0 255.255.255.0
Switch(dhcp-config)#default-router 192.168.40.1
Switch(dhcp-config)#exit
Switch(config)#
```



可以看到设备都以分配IP并实现互通

![image-20241121194307737](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241121194307737.png)

```
C:\>ping 192.168.20.2

Pinging 192.168.20.2 with 32 bytes of data:

Request timed out.
Reply from 192.168.20.2: bytes=32 time=41ms TTL=127
Reply from 192.168.20.2: bytes=32 time=28ms TTL=127
Reply from 192.168.20.2: bytes=32 time=25ms TTL=127

Ping statistics for 192.168.20.2:
    Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
Approximate round trip times in milli-seconds:
    Minimum = 25ms, Maximum = 41ms, Average = 31ms

```

查看服务器的IP

```
Cisco Packet Tracer SERVER Command Line 1.0
C:\>ipconfig

FastEthernet0 Connection:(default port)

   Connection-specific DNS Suffix..: 
   Link-local IPv6 Address.........: FE80::2E0:F7FF:FE91:3E40
   IPv6 Address....................: ::
   Autoconfiguration IPv4 Address..: 169.254.62.64
   Subnet Mask.....................: 255.255.0.0
   Default Gateway.................: ::
                                     0.0.0.0

```

测试设备与服务器的连通性

```
C:\>ping 169.254.62.64

Pinging 169.254.62.64 with 32 bytes of data:

Reply from 192.168.10.1: Destination host unreachable.
Reply from 192.168.10.1: Destination host unreachable.
Reply from 192.168.10.1: Destination host unreachable.
Reply from 192.168.10.1: Destination host unreachable.

Ping statistics for 169.254.62.64:
    Packets: Sent = 4, Received = 0, Lost = 4 (100% loss),
```

发现无法联通，而且是网关返回的消息，可以判断是因为路由没有设置。通过图形化操作界面快速设置一下。

![image-20241121194744516](C:\Users\Holme\AppData\Roaming\Typora\typora-user-images\image-20241121194744516.png)

设置默认路由

```
ip route 0.0.0.0 0.0.0.0 192.168.1.1
```



然后测试连通性最后发现联通

```
C:\>ping 169.254.62.64

Pinging 169.254.62.64 with 32 bytes of data:

Request timed out.
Reply from 169.254.62.64: bytes=32 time=41ms TTL=127
Reply from 169.254.62.64: bytes=32 time=28ms TTL=127
Reply from 169.254.62.64: bytes=32 time=25ms TTL=127

Ping statistics for 169.254.62.64:
    Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
Approximate round trip times in milli-seconds:
    Minimum = 25ms, Maximum = 41ms, Average = 31ms
```

